#+STARTUP: overview 
*** Navigation
#+BEGIN_SRC emacs-lisp
;; dumb-jump
(use-package dumb-jump
   :ensure t)

(setq xref-backend-functions (remq 'etags--xref-backend xref-backend-functions))
(add-to-list 'xref-backend-functions #'dumb-jump-xref-activate t)


#+END_SRC

#+RESULTS:
| dumb-jump-xref-activate |

*** Common Tools
#+BEGIN_SRC emacs-lisp
;; Rust major mode
(use-package yasnippet
   :ensure t)
   
(setq yas-snippet-dirs
   '("~/.emacs.d/snippets"))

(yas-global-mode 1)
(yas-reload-all)
(add-hook 'yas-minor-mode-hook (lambda ()
(yas-activate-extra-mode 'fundamental-mode)))
#+END_SRC

#+RESULTS:
| (lambda nil (yas-activate-extra-mode 'fundamental-mode)) | yas-minor-mode-set-explicitly |

*** Rust
#+BEGIN_SRC emacs-lisp
;; Rust major mode
(use-package rust-mode 
   :ensure t)
 
;; Racer 
(use-package racer 
   :ensure t)

(setq racer-cmd "~/.cargo/bin/racer") ;; Rustup binaries PATH
(setq racer-rust-src-path "/home/daan/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src") ;; Rust source code PATH

(add-hook 'rust-mode-hook #'racer-mode)
(add-hook 'racer-mode-hook #'eldoc-mode)
(add-hook 'racer-mode-hook #'company-mode)

(require 'rust-mode)
(define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
(setq company-tooltip-align-annotations t)

;; Cargo minor mode
(use-package cargo 
   :ensure t)
(add-hook 'rust-mode-hook 'cargo-minor-mode)

;; Eshell automaticly compiles project

#+END_SRC

#+RESULTS:
| cargo-minor-mode | racer-mode |
**** Org LaTeX
#+BEGIN_SRC emacs-lisp
;; inside .emacs file
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+END_SRC

#+RESULTS:
| pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f |
**** Personal Tweaks
#+BEGIN_SRC emacs-lisp
;; personal tweaks
(setq org-startup-indented t)             ;; Indent according to section
(setq org-startup-with-inline-images t)   ;; Display images in-buffer by default
(setq org-indent-indentation-per-level 1)
#+END_SRC

#+RESULTS:
: 1

*** Roam
#+BEGIN_SRC emacs-lisp
(use-package org-roam
  :ensure t
  :init)
  
;;(make-directory "~/org-roam")
(setq org-roam-directory "~/org-roam")
(add-hook 'after-init-hook 'org-roam-mode)
#+END_SRC

#+RESULTS:
| x-wm-set-size-hint | org-roam-mode | #[0 \300 \207 [dashboard-insert-startupify-lists] 1] | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version |

